#ifndef __74HC164_H_
#define __74HC164_H_



    /* -------------------------------------------------- */
    // ● 宏定义
    /* -------------------------------------------------- */

    /**
     * 74HC164 对应的针脚定义
     * 请在 74hc164.c 文件中的 HC164_GetDataPin()   函数内定义 PIN
     * 请在 74hc164.c 文件中的 HC164_GetDataPort()  函数内定义 PORT
     * 请在 74hc164.c 文件中的 HC164_GetClockPin()  函数内定义 PIN
     * 请在 74hc164.c 文件中的 HC164_GetClockPort() 函数内定义 PORT
     */
    // GPIOX
    // GPIO_PIN_X



    /* -------------------------------------------------- */
    // ● 函数声明
    /* -------------------------------------------------- */
    void HC164_Init();
    void HC164_SendByte( short number, u8 byte );
    
    
    
#endif