#ifndef __KEY_H_
#define __KEY_H_



    /* -------------------------------------------------- */
    // ● KEY 采用 74HC165 控制
    // ● 使用前务必先对 74HC165 进行初始化
    /* -------------------------------------------------- */



    /* -------------------------------------------------- */
    // ● 宏定义
    /* -------------------------------------------------- */

    /**
     * Key 常量
     */
    #define KEY_STATE_NO       0
    #define KEY_STATE_YES      1
    #define KEY_STATE_INVALID -1


    
    /* -------------------------------------------------- */
    // ● 函数声明（API）
    /* -------------------------------------------------- */
    void  KEY_DatLoad();                               // Key 数据装载
    short KEY_IsPress( short number, bool autoload );  // Key 是否按下
    

    
    /* -------------------------------------------------- */
    // ● 函数声明（主逻辑）
    /* -------------------------------------------------- */
    void  KEY_MainKeyMapLed();     // 主逻辑：按下点亮灯
    void  KEY_MainKeyMapBuzzer();  // 主逻辑：按下蜂鸣器响

    
    
#endif